Revit 2022 API
StructuralSettings.AnalyticalModelCheckBeamSlabDistance Property
 Whether to check the analytical model distance between beam and slab for a level.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool AnalyticalModelCheckBeamSlabDistance { get; set; }
Visual Basic
Public Property AnalyticalModelCheckBeamSlabDistance As Boolean
	Get
	Set
Visual C++
public:
property bool AnalyticalModelCheckBeamSlabDistance {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace